#1. Queue ต่างจาก Stack อย่างไร?
##  Queue  เข้าก่อน ออกก่อน ข้อมูลที่เข้ามาในคิวก่อน จะถูกนำออกจากคิวก่อน 
### Stack  เข้าหลัง ออกก่อน ข้อมูลที่เข้ามาในสแตกทีหลัง จะถูกนำออกจากสแตกก่อน

#2. เพราะเหตุใดการ dequeue จึงใช้ pop(0) แทนที่จะเป็น pop()?
## เราจึงต้องใช้ pop(0) เพื่อระบุว่าเราต้องการนำข้อมูลออกจาก List ที่ตำแหน่งแรก (หัวคิว) ซึ่งสอดคล้องกับหลักการ dequeue ที่ต้องนำข้อมูลที่อยู่หน้าสุดของคิวออก

#3. ยกตัวอย่างการประยุกต์ใช้ Queue ในชีวิตประจำวันมา 3 ตัวอย่าง 
## การต่อแถวซื้อของในเซเว่น
## การต่อคิวเข้ารับบริการรักษาตัว
## การรอคิวธนาคาร

#4. หากต้องการทำ Priority Queue จะต้องปรับปรุงโค้ดอย่างไร?
## จัดเรียงลำดับความสำคัญของข้อมูลที่จะเข้าคิวได้ โดยข้อมูลที่มีลำดับความสำคัญสูงกว่า จะถูกนำออกจากคิวก่อน แม้ว่าจะเข้ามาในคิวทีหลังก็ตาม
   